IDEA StatiCa Open Model
ProjectDataConcrete.DesignWorkingLife Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Design working fife
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public int DesignWorkingLife { get; set; }
Public Property DesignWorkingLife As Integer
	Get
	Set
public:
property int DesignWorkingLife {
	int get ();
	void set (int value);
}
Property Value
Type: Int32
See Also
Reference
ProjectDataConcrete Class
IdeaRS.OpenModel.Concrete Namespace